# RevisionNumberingSequenceId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Revision..::..RevisionNumberingSequenceId Property
Revision Class See Also
---
The id of the revision numbering sequence which controls this revision's numbering.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ElementId RevisionNumberingSequenceId { get; set; }
```

Visual Basic
---
```text
Public Property RevisionNumberingSequenceId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ RevisionNumberingSequenceId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: revisionNumberingSequenceId doesn't represent a RevisionNumberingSequence element. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: This operation cannot be performed on Revisions that have already been issued. |

# See Also
Revision Class
Autodesk.Revit.DB Namespace